tap "anomalyco/tap"
tap "dail8859/notepadnext"
tap "gromgit/fuse"
tap "homebrew/services"
tap "mutagen-io/mutagen"
tap "nikitabobko/tap"
tap "supabase/tap"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Google's own build tool
brew "bazel"
# Package manager for C programming
brew "clib"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Utilities for the ext2, ext3, and ext4 file systems
brew "e2fsprogs"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Command-line interface for JFrog products
brew "jfrog-cli"
# GNOME XML library
brew "libxml2"
# C XSLT library for GNOME
brew "libxslt"
# Generic machine emulator and virtualizer
brew "qemu"
# Additional guest agents for Lima
brew "lima-additional-guestagents"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# General-purpose scripting language
brew "php"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Python version management
brew "pyenv"
# Python interface to Tcl/Tk
brew "python-tk@3.10"
# Python interface to Tcl/Tk
brew "python-tk@3.12"
# Repository tool for Android development
brew "repo"
# Display and control your Android device
brew "scrcpy"
# Cross-platform application to monitor your network traffic
brew "sniffnet"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Additional completion definitions for zsh
brew "zsh-completions"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# Fast file synchronization and network forwarding for remote development
brew "mutagen-io/mutagen/mutagen"
# Supabase CLI
brew "supabase/tap/supabase"
# View, create, manipulate, print and manage files in Portable Document Format
cask "adobe-acrobat-pro"
# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Write, edit, and chat about your code with AI
cask "cursor"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Developer platform
cask "dotnet-sdk"
# Collaborative team software
cask "figma"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# GIT client
cask "fork"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Utility to hide menu bar items
cask "hiddenbar"
# Terminal built on web technologies
cask "hyper"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# File system integration
cask "macfuse"
# Visual diff and merge tool
cask "meld"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Network information and diagnostics utility
cask "neo-network-utility"
# App to write, plan, collaborate, and get organised
cask "notion"
# WebKit based web browser
cask "orion"
# Desktop virtualization software
cask "parallels"
# Home media server
cask "plex-media-server"
# IDE for Python programming - Community Edition
cask "pycharm-ce"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Email client
cask "readdle-spark"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Remote access and connectivity software focused on security
cask "teamviewer"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@17"
# Open-source BitTorrent client
cask "transmission"
# Disk encryption software focusing on security based on TrueCrypt
cask "veracrypt"
# Open-source code editor
cask "visual-studio-code"
# Open-source version of the X.Org X Window System
cask "xquartz"
vscode "bitlang.cobol"
vscode "charliermarsh.ruff"
vscode "codezombiech.gitignore"
vscode "d-biehl.robotcode"
vscode "demystifying-javascript.python-extensions-pack"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "oderwat.indent-rainbow"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "robocorp.robotframework-lsp"
vscode "samuelcolvin.jinjahtml"
vscode "talhabalaj.actual-font-changer"
vscode "undefined_publisher.voidflare-theme"
vscode "wholroyd.jinja"
